use my_sait;
insert into article (time_of,header_of_article,type_of_article,text) values(NOW(),"hotkeys","programing","
Поиск и замена
<br/> Ctrl + F	Поиск
<br/> F3	Поиск вперед
<br/> Shift + F3	Поиск назад
<br/> Ctrl + R	Замена
<br/> Ctrl + Shift + F	Поиск в проекте
<br/> Ctrl + Shift + R	Замена в проекте
<br/> Ctrl + Shift + S	Поиск используя шаблон
<br/> Ctrl + Shift + M	Замена используя шаблон
<br/> 
<br/> Редактирование/генерация кода
<br/> Ctrl + Space	Компоненты (классы, методы, переменные)
<br/> Ctrl + Shift + Space	«Смарт Код» — фильтрует по списку методов и переменных ожидаемого типа
<br/> Ctrl + Alt + Space	Название класса в проекте независимо от импортируемых классов
<br/> Ctrl + Shift + Enter	Завершаем оператор
<br/> Ctrl + P	Данные о параметрах (в пределах сигнатуры вызываемого метода)
<br/> Ctrl + F1	Показать описания ошибки или предупреждения
<br/> Alt + Insert	Генерируем код (Getters, Setters, Constructors, hashCode/equals, toString)
<br/> Ctrl + O	Переопределяем метод
<br/> Ctrl + I	Реализуем метод
<br/> Ctrl + Alt + T	Помещаем часть кода в (if..else, try..catch, for, synchronized, etc.)
<br/> Ctrl + /	Однострочный комментарий / убрать комментарий
<br/> Ctrl + Shift + /	Много строчный комментарий / убрать комментарий
<br/> Ctrl + W	Выбирает последовательность возрастающих блоков кода
<br/> Alt + Enter	Показать исправление
<br/> Ctrl + Alt + L	Форматируем код
<br/> Ctrl + Alt + O	Удаляем лишние/неиспользуемые import
<br/> Ctrl + Alt + I	Авто-отступ линии
<br/> Tab / Shift + Tab	Отступ или удаление отступа выбранной части кода
<br/> Ctrl + X or Shift + Delete	Вырезать часть кода
<br/> Ctrl + C or Ctrl + Insert	Копировать часть кода
<br/> Ctrl + V or Shift + Insert	Вставить фрагмент кода из буфера обмена
<br/> Ctrl + Shift + V	Вставить последний фрагмент кода из буфера обмена
<br/> Ctrl + D	Дублировать строку
<br/> Ctrl + Y	Удалить строку
<br/> Ctrl + Shift + J	Объединить строку
<br/> Ctrl + Enter	Разделить строки
<br/> Shift + Enter	Начать с новой строки
<br/> Ctrl + Shift + U	Переключить стоящее слово рядом с кареткой в нижний / верхний регистр
<br/> Ctrl + Shift + ] / [	Выделить код до конца / начала блока
<br/> Ctrl + Delete	Удалить слово после каретки
<br/> Ctrl + Backspace	Удалить слово перед каретки
<br/> Ctrl + NumPad+/-	Развернуть / свернуть блок кода
<br/> Ctrl + Shift + NumPad+	Развернуть все
<br/> Ctrl + Shift + NumPad-	Свернуть все
<br/> Ctrl + F4	Операция «закрыть активное окно редактора»
<br/> 
<br/> Поиск использования кода
<br/> Alt + F7 / Ctrl + F7	Найти использования / Найти использования в файле
<br/> Ctrl + Shift + F7	Выделить используемое в файле
<br/> Ctrl + Alt + F7	Показать использования
<br/> 
<br/> Компиляция/выполнение/отладка
<br/> Ctrl + F9	Структурировать проект и собрать измененные файлы
<br/> Ctrl + Shift + F9	Компилируем выбранный файл пакета или модуля
<br/> Alt + Shift + F10	Выбираем конфигурацию и запускаем
<br/> Alt + Shift + F9	Выбираем конфигурацию и запускаем в debug режиме
<br/> Shift + F10	Запускаем
<br/> Shift + F9	Запускаем в debug режиме
<br/> Ctrl + Shift + F10	Выполняем в контексте конфигурации из редактора
<br/> F8	Шаг обхода
<br/> F7	Шаг
<br/> Shift + F7	«Умный» шаг
<br/> Shift + F8	Выход
<br/> Alt + F9	Запуск до курсора
<br/> Alt + F8	Вычислить выражение
<br/> F9	«Резюме» программы
<br/> Ctrl + F8	Переключаем точку остановки
<br/> Ctrl + Shift + F8	Показываем точки остановки
<br/> 
<br/> Навигации
<br/> Ctrl + N	Переход к классу
<br/> Ctrl + Shift + N	Переход к файлу
<br/> Ctrl + Alt + Shift + N	Переход к символу
<br/> Alt + Right/Left	Перейти к следующей / предыдущей вкладки редактора
<br/> F12	Вернуть предыдущее окно инструмента
<br/> Esc	Переход к редактору
<br/> Shift + Esc	Скрываем активное или последнее активное окно
<br/> Ctrl + Shift + F4	Закрыть активное run/messages/find/…-окно
<br/> Ctrl + G	Переход к определенной строки
<br/> Ctrl + E	Показать последние файлы
<br/> Ctrl + Alt + Left/Right	Переход назад / вперед
<br/> Ctrl + Shift + Backspace	Переход в последнее местоположение Редактора
<br/> Ctrl + B or Ctrl + Click	Переход к объявлению
<br/> Ctrl + Alt + B	Переход к реализации
<br/> Ctrl + Shift + I	Открыть быстрый поиск по определению
<br/> Ctrl + Shift + B	Переход к объявления типа
<br/> Ctrl + U	Переход к суперметоду или классу
<br/> Alt + Up/Down	Перейти к предыдущему / следующему методу
<br/> Ctrl + ] / [	Переход в конец / начало блока
<br/> Ctrl + F12	Показать файловую структуру
<br/> Ctrl + H	Показать иерархии типа
<br/> Ctrl + Shift + H	Показать иерархии метода
<br/> Ctrl + Alt + H	Показать иерархии вызовов
<br/> F2 / Shift + F2	Выделение следующей / предыдущей ошибки
<br/> F4 / Ctrl + Enter	Произвести редактирование исходника / Просмотр
<br/> Alt + Home	Показывать панель навигации
<br/> Ctrl + #[0-9]	Переход к номеру закладки
<br/> 
<br/> Рефакторинг
<br/> F5	Копировать
<br/> F6	Перемещение
<br/> Alt + Delete	Безопасно удалить
<br/> Shift + F6	Переименование
<br/> Ctrl + F6	Изменение сигнатуры
<br/> Ctrl + Alt + N	Встраивание
<br/> Ctrl + Alt + M	Помещение в метод
<br/> Ctrl + Alt + V	Помещение в переменную
<br/> Ctrl + Alt + F	Помещение в поле
<br/> Ctrl + Alt + C	Помещение в константу
<br/> Ctrl + Alt + P	Помещение в параметр
<br/> 
<br/> Live template
<br/> Ctrl + Alt + J	Окружить с «живым шаблоном»
<br/> Ctrl + J	Вставьте живой шаблон
<br/> iter	Итерация как в SDK 1.5
<br/> inst	Проверка типа объекта через InstanceOf
<br/> itco	Итерирование элементов java.util.Collection
<br/> itit	Итерирование элементов java.util.Iterator
<br/> itli	Итерирование элементов java.util.List
<br/> psf	Развертывание до public static final
<br/> thr	Развертывание до throw new
<br/> sout	Развертывание до System.out.println()
<br/> 
<br/> Работа с интерфейсом IDE
<br/> Alt + #[0-9]	Открыть соответствующее окно инструмента
<br/> Ctrl + S	Сохраняем все
<br/> Ctrl + Alt + Shift + S	Открываем окно Структура проекта
<br/> Ctrl + Shift + A	Находим нужное действие
<br/> Ctrl + Tab	Переключает вкладки и окна
");



    
